# --- ЭТАП 1: СБОРКА ---
# Используем официальный образ с компилятором GCC
FROM gcc:latest as builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем папку с исходниками из нашего проекта в контейнер
COPY src/ ./src/

# Копируем файл проекта Visual Studio (может понадобиться для зависимостей)
COPY src/ ./src/

# Запускаем команду компиляции. Она берет наш .cpp файл
# и создает исполняемый файл "watcher"
RUN g++ -o watcher src/Prophet.Watcher.cpp -static.

# Запускаем команду компиляции. Она берет наш .cpp файл
# и создает исполняемый файл "watcher"
RUN g++ -o watcher src/Prophet.Watcher.cpp -static

# --- ЭТАП 2: ФИНАЛЬНЫЙ ОБРАЗ ---
# Используем минимальный образ, чтобы контейнер был маленьким
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем ТОЛЬКО скомпилированный файл из этапа сборки
COPY --from=builder /app/watcher .

# Команда, которая будет запускаться при старте контейнера
CMD ["./watcher"]